# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name rc -cap_table {../../lib/sky130_cap.captable} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0}
create_library_set -name libSTD -timing {../../lib/scs130lp_tt_1.62_25_nldm.lib}
create_constraint_mode -name Constraints -sdc_files {../../synthesis/work/output/snn_fixed_16_2_4_4_2_syn.sdc}
create_delay_corner -name Delay -library_set {libSTD} -rc_corner {rc}
create_analysis_view -name Default -constraint_mode {Constraints} -delay_corner {Delay}
set_analysis_view -setup {Default} -hold {Default}
